    [
        {
            "id": "1",
            "bodyRegion": "Delts & Shoulders",
            "exercisesName": "Arnold Press (Anterior)",
            "imageUrl": "https://s35247.pcdn.co/wp-content/uploads/2018/09/3-2-800x600.png",
            "videoUrl": "https://www.youtube.com/watch?v=mXRhpXwW-gs",
            "description" : " 1. Grab your dumbbells. \n\n 2. Take a seat for efficiency, preferably on the workout bench. \n\n 3. Place the dumbbells on your thighs as you sit. \n\n 4. Initial position: Keep your back straight and lift the weights just above your shoulder in front of you ( palm facing towards you.) \n\n 5.Slowly raise your arms and twist your hands inwards and take your arms over your shoulder. Hold for a sec. \n\n 6. Bring back the arms slowly towards against the resistance, back to the initial position."

        },
        {
            "id": "2",
            "bodyRegion": "Delts & Shoulders",
            "exercisesName": "Dumbbell Side Raise (Lateral)",
            "imageUrl": "https://s35247.pcdn.co/wp-content/uploads/2018/09/2-2-800x600.png",
            "videoUrl": "https://www.youtube.com/watch?v=WJm9zA2NY8E",
            "description" : " 1. Pick your dumbbells. \n\n 2.Stand straight, chest out and feet not more than shoulder apart. \n\n 3.initial position: Lift the dumbbells on the side keeping arms slightly bent. Hold for a sec. \n\n 4.Slowly bring it back down."
        },
        {
            "id": "3",
            "bodyRegion": "Delts & Shoulders",
            "exercisesName": "Bent Over Lateral Raise (Posterior)",
            "imageUrl": "https://s35247.pcdn.co/wp-content/uploads/2018/09/1-2.png.webp",
            "videoUrl": "https://www.youtube.com/watch?v=ttvfGg9d76c",
            "description" : " 1. Grab your dumbbells. \n\n 2. Take a seat for efficiency, preferably on the workout bench. \n\n 3.Initial position: Bend forward almost 45 degrees and keep your hands on the side to let the dumbbells hanging. \n\n 4. Keeping your back straight and letting arms slightly bent, pull the dumbbells on the side, against the gravity. Hold for a sec. \n\n 5. Slowly bring back to initial position."
        },
        {
            "id": "4",
            "bodyRegion": "Lats",
            "exercisesName": "Lat Pull-down",
            "imageUrl": "https://fitbodybuzz.com/wp-content/uploads/2019/08/lat-pulldown-muscles-worked.png",
            "videoUrl": "hhttps://www.youtube.com/watch?v=2eyUzw9EMuU",
            "description" : " Wide-grip lat pulldown: The wider grip of this variation puts even more emphasis on your lats than a standard lat pulldown. \n\n 1. Grab the lat bar with an overhand grip and sit on the lat pulldown machine with your legs securely under the thigh pads and your feet on the floor. Your grip should be slightly wider than shoulder-width. \n\n 2. Rotate your shoulders outward to engage your lats. Your shoulder blades should be in a neutral or slightly protracted position. Keep your arms long with a slight bend in your elbows. Your shoulders should be directly over your hips with a neutral head and neck position. Your chin should remain tucked throughout the movement, as if you were holding an egg under your chin. All repetitions should begin from this starting position. \n\n 3. Initiate the downward movement by simultaneously pulling your shoulder blades down and pulling your elbows towards your body. Continue to pull your shoulder blades toward your spine as you squeeze your upper back and lat muscles until the lat bar reaches your collar bones. Pause at the bottom of the movement. \n\n 4.Begin the upward movement by simultaneously straightening your arms and allowing your shoulder blades to move up and away from your spine. Slowly allow the lat bar to travel back to the starting position. "
        },
        {
            "id": "5",
            "bodyRegion": "Lats",
            "exercisesName": "Straight-arm Lat Pulldown",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2020/01/straight-arm-pulldowns-muscles-worked.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=wcVDItawocI",
            "description" : " Wide-grip lat pulldown: The wider grip of this variation puts even more emphasis on your lats than a standard lat pulldown."
        },
        {
            "id": "6",
            "bodyRegion": "Lats",
            "exercisesName": "Dumbbell Pullover",
            "imageUrl": "https://www.inspireusafoundation.org/wp-content/uploads/2021/11/dumbbell-pullover-2048x1109.png",
            "videoUrl": "https://www.youtube.com/watch?v=5YStMv6m2g8",
            "description" : " 1. Lie across the bench with only your upper back and neck being supported by the bench \n\n 2. Hold dumbbell with both hands, forming a triangle with your hands or by gripping the inner plate \n\n 3. Hold the dumbbell directly above your chest with elbows bent slightly \n\n 4. Engage your core and slowly lower the dumbbell past your face and over your head as far as you can \n 5. Pull the dumbbell back over your face to starting position"
        },
        {
            "id": "7",
            "bodyRegion": "Lats",
            "exercisesName": "Inverted Row",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2018/05/inverted-row-guide.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=hXTc1mDnZCw",
            "description" : " 1. Set up bar slightly higher than your arm’s length above the ground \n\n 2. Sit under the bar with your legs stretched out in front of you \n 3. Reach up grabbing the bar with both hands using an overhand grip wider than shoulder width apart \n\n 4. Straighten your body so your arms are straight and heels are on the floor \n 5. Pull up by retracting your shoulder blades until your chest hits the bar \n\n 5. Slowly lower to starting position"
        },
        {
            "id": "8",
            "bodyRegion": "Lats",
            "exercisesName": "Underhand Yates Row",
            "imageUrl": "https://mybodyweightexercises.com/wp-content/uploads/2021/09/bent-over-rows-muscles-worked.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=vzMDGeH5lCY",
            "description" : " 1. Grab a barbell with both hands using an underhand grip at shoulder width \n\n 2. Bend and the knees and hinge forward at the hips at 45 degrees \n\n 3. Your arms should be almost fully extended with the bar over your thighs \n\n 4. Pull the bar up to your waist \n\n 5. Briefly pause at the top then slowly return to starting position"
        },
        {
            "id": "9",
            "bodyRegion": "Lats",
            "exercisesName": "High Cable Row/Face Pull ",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2019/08/face-pull-exercise-muscles-worked-details.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=eIq5CB9JfKE&t=314s",
            "description" : " Another common error is grip. Athletes should use an underhand grip as opposed to overhand. While performing the face pull it’s also important to make sure that you are taking a strong, stable athletic stance and leading with your hands and not your elbows. You never wants to lean backwards as this allows the lower back to contribute. If you find yourself doing this fault it’s likely because you’re making another common error… using too much weight. \n\n The weight you use on the face pull should be enough to get meaningful contractions in the target muscles for building strength but not so much weight that you need extra momentum or backward lean in order to move the weight. This is NOT a power move or an opportunity to demonstrate your strength."
        },
        {
            "id": "10",
            "bodyRegion": "Lats",
            "exercisesName": "Pull Ups",
            "imageUrl": "https://fitfact.dk/wp-content/uploads/2020/10/pullupsmuskler-1024x788.png",
            "videoUrl": "https://www.youtube.com/watch?v=eGo4IYlbE5g",
            "description" : " 1. Grab the bar, hands shoulder width apart using an overhand grip \n\n 2. Begin with arms completely straight and pull your chest up toward the bar as high as you can. \n\n 3. Hold briefly at the top then return to starting position"
        },
        {
            "id": "11",
            "bodyRegion": "Lats",
            "exercisesName": "Chin Ups",
            "imageUrl": "https://qph.fs.quoracdn.net/main-qimg-614a39f944254ddaba6e1252814e1b46-lq",
            "videoUrl": "https://www.youtube.com/watch?v=brhRXlOhsAM",
            "description" : " 1. Grab the bar, hands shoulder width apart palms with an underhand grip \n\n 2. Begin with arms completely straight and pull your chest up to the bar as high as you can \n\n 3. Hold briefly at the top then return to starting position"
        },
        {
            "id": "12",
            "bodyRegion": "Lats",
            "exercisesName": "Dombbell Rows",
            "imageUrl": "https://i.pinimg.com/originals/42/ba/3f/42ba3fde9e7f9b31f958d0c39db407fc.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=roCP6wCXPqo",
            "description" : " 1. Grab a dumbbell with a neutral grip with your right hand then place your right knee and right hand under your shoulder on a bench. Hold the dumbbell with your left arm straight directly under your left shoulder. \n\n 2. Pull the dumbbell upwards, bending at the elbow and keeping your arm close to your body until the dumbbell is next to your hip \n\n 3. Slowly lower to starting position"
        },
        {
            "id": "13",
            "bodyRegion": "Lats",
            "exercisesName": "Cable Supine Reverse Fly",
            "imageUrl": "https://i.pinimg.com/originals/90/16/b8/9016b8476acd327cecdb20e84c27910c.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=keVMaHL8ME0",
            "description" : " 1. Sit on a bench with your knees bent then reach forward and grab the triangle handle \n\n 2. Pull the handle back towards your navel keeping your back straight and squeezing your shoulder blades together \n\n 3. Slowly return to starting position"
        },
        {
            "id": "14",
            "bodyRegion": "Traps",
            "exercisesName": "Trap Bar Shrug",
            "imageUrl": "https://www.burnthefatinnercircle.com/members/images/2171c.jpg?cb=20220105104837",
            "videoUrl": "https://www.youtube.com/watch?v=C6sYjDFuq9I",
            "description" : "Perform a standard deadlift with the trap bar to begin the exercise from a standing position. Once motionless, shrug the shoulders up and towards the ears. Focus on elevating your shoulders without rounding them forward. Once at the top, lower under control."
        },
        {
            "id": "15",
            "bodyRegion": "Traps",
            "exercisesName": "Cable Shrug",
            "imageUrl": "https://i0.wp.com/www.fitliferegime.com/wp-content/uploads/2022/04/Cable-Shrug.jpg?w=840&ssl=1",
            "videoUrl": "https://www.youtube.com/watch?v=Wab3-dsZohU",
            "description" : "Stand in front of a cable machine and grab the rope attachment with both hands and feet shoulder-width apart. Keep your shoulders down, chest up, and hold the rope with arms extended. Without using your arms, exhale and bring your shoulders towards your ears and then pull back slightly. Pause and slowly return to the starting position."
        },
        {
            "id": "16",
            "bodyRegion": "Traps",
            "exercisesName": "Kirk Shrug",
            "imageUrl": "https://live.staticflickr.com/4299/35914093176_8c44b13a00_z.jpg",
            "videoUrl": "https://youtu.be/VfgRpBhiBLI",
            "description" : "Assume a thumbless grip on the barbell and perform a standard shrug from a standing position. However, bend the elbows as you shrug as if you were doing the first half of an upright row. Hold the barbell around navel level for a moment if possible before lowering the weight to the starting position."
        },
        {
            "id": "17",
            "bodyRegion": "Traps",
            "exercisesName": "Barbell Overhead Carry",
            "imageUrl": "https://i.pinimg.com/originals/14/3c/77/143c77713c4b0524bfe5773a818ae23a.jpg",
            "videoUrl": "https://youtu.be/8Wu6rNlmSoU",
            "description" : "Set a bar at chest height in a power rack and unrack it. Perform a press, push press, or jerk to secure the barbell overhead. While keeping the barbell fixed above your head with locked arms, take small and controlled steps for distance or time."
        },
        {
            "id": "18",
            "bodyRegion": "Traps",
            "exercisesName": "Farmer’s Carry",
            "imageUrl": "https://weighttraining.guide/wp-content/uploads/2021/04/Dumbbell-farmers-walk-2.png",
            "videoUrl": "https://youtu.be/rt17lmnaLSM",
            "description" : "With a dumbbell in each hand — consider using straps if you aren’t concerned with grip strength — take steady, controlled steps in a straight line. Walk with an upright posture and don’t allow your body to list to one side or meander off your intended line. Let the shoulders hang away from the ears."
        },
        {
            "id": "19",
            "bodyRegion": "Traps",
            "exercisesName": "Dombbell Rows",
            "imageUrl": "https://i.pinimg.com/originals/42/ba/3f/42ba3fde9e7f9b31f958d0c39db407fc.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=roCP6wCXPqo",
            "description" : " 1. Grab a dumbbell with a neutral grip with your right hand then place your right knee and right hand under your shoulder on a bench. Hold the dumbbell with your left arm straight directly under your left shoulder. \n\n 2. Pull the dumbbell upwards, bending at the elbow and keeping your arm close to your body until the dumbbell is next to your hip \n\n 3. Slowly lower to starting position"
        },
        {
            "id": "20",
            "bodyRegion": "Traps",
            "exercisesName": " Rack Pull",
            "imageUrl": "https://weighttraining.guide/wp-content/uploads/2016/12/rack-pull-resized.png",
            "videoUrl": "https://youtu.be/EAcUmuTr7Zs",
            "description" : "While standing in a power rack, set the safety bars to around knee height. With your core tight and spine neutral, hinge at the hip, grab the bar, and then pull the barbell to lockout. Slowly lower the weight to the starting position, resisting the pull of the weight on the way down."
        },
        {
            "id": "21",
            "bodyRegion": "Traps",
            "exercisesName": " Rack Pull",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2019/04/seated-dumbbell-lateral-raise-750x474.jpg",
            "videoUrl": "https://youtu.be/v_ZkxWzYnMc",
            "description" : "Stand tall with a dumbbell in each hand and arms at your sides, palms facing in. Position your feet roughly shoulder-width apart. Raise your arms and lift the dumbbells up and out to each side, stopping when your elbows reach around shoulder-height. Pause and hold for a second at the top of the movement. Control the weight as you return to the starting position."
        },
        {
            "id": "22",
            "bodyRegion": "Triceps",
            "exercisesName": "Close-Grip Bench Press",
            "imageUrl": "https://thumbs.dreamstime.com/b/exercising-close-grip-barbell-bench-press-target-muscles-marked-red-initial-final-steps-67126548.jpg",
            "videoUrl": "https://youtu.be/cXbSJHtjrQQ",
            "description" : "Not only does this tricep exercise work on the targeted area, but it will also improve upon your chest and core. To execute, perform the following steps: \n\n 1. Grab a barbell with an overhand grip, keeping your index fingers on the inside edge of the knurling (i.e. the rough and textural part of the bar) \n\n 2. Slightly arch your back to create minor space between your lower back and the bench.\n\n 3. Life the bar off the rack and hold it above your sternum, keeping your arms completely straight and your elbows tucked at 45-degree angles on either side. \n\n 4. Lower the bar until it lightly touches your body, pause, and then drive through at your feet as you press the bar upward. \n\n 5. For the last set, consider reducing the weight and then increasing the number of reps, pushing yourself to failure."
        },
        {
            "id": "23",
            "bodyRegion": "Triceps",
            "exercisesName": "Cable Rope Tricep Pushdown",
            "imageUrl": "https://gym.dromosys.com/media/exercise-images/390/Triceps-Rope-Push-down_1.png",
            "videoUrl": "https://youtu.be/REWv05om0ho",
            "description" : "If you’re targeting the triceps, don’t overdo it on the weights when performing this exercise. Here’s how: \n\n 1. Attach a rope to the cable station’s high pulley. \n\n 2. Grab the handle with an overhand grip, keeping your arms bent and your hands shoulder-width apart. \n\n 3. Tuck your upper arms toward your sides. \n\n 4. Keeping your upper arms fixed in place, push the bar down until your elbows are locked. \n\n 5. Return to the starting position and repeat."
        },
        {
            "id": "24",
            "bodyRegion": "Triceps",
            "exercisesName": "Lying Triceps Extension",
            "imageUrl": "https://www.burnthefatinnercircle.com/members/images/1622b.jpg",
            "videoUrl": "https://youtu.be/4re6CJ0XNF8",
            "description" : "This exercise is sometimes known as the skullcrusher and that alone should tell you it’s not for beginners. And while there’s more than one way to perform it (over-the-head vs behind-the-head, for instance), elbow extension remains constant. \n\n After you’ve mastered other tricep workouts and exercises, bring this one into the fold. When you’ve become a true master of your upper domain, perform this tricep exercise and a dumbbell chest press as a superset. \n\n Here’s one variant: \n\n 1. Grabbing the inner grip, press an EZ bar over your chest in the overhand grip position. \n\n 2. Extend your arms straight up. \n\n 3. Keeping your elbows tucked in and your arms perpendicular to the floor, gradually lower the bar until it’s just above your forehead by about an inch. \n\n 4. Slowly bring your arms back to the starting position without locking your elbows."
        },
        {
            "id": "25",
            "bodyRegion": "Triceps",
            "exercisesName": "Dips",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2021/12/Chest-Dips-vs-Triceps-Dips.jpg",
            "videoUrl": "https://youtu.be/35PXVWP1XVs",
            "description" : "Here’s another tricep exercise for men who have more experience under their respective belts. It involves using your entire body weight and should be avoided by those with weak shoulders. Start with just 2 sets of 8-10 reps and increase the number of sets and reps as you improve over time. Here we go: \n\n 1. Prop yourself up on the parallel bars, keeping your torso perpendicular to the floor. \n\n 2. Maintaining your original position throughout, bend your knees and cross your ankles. \n\n 3. Lower your body until your shoulder joints are below your elbows or just before you reach that position.\n\n 4. Push back up to the starting position, until your elbows are just short of locked."
        },
        {
            "id": "26",
            "bodyRegion": "Triceps",
            "exercisesName": "Diamond Push-Ups",
            "imageUrl": "https://images.squarespace-cdn.com/content/v1/55e406fbe4b0b03c5e7543ae/1588273637239-QAA997U1TA0CGDYOJNUE/Diamond+Push+Ups?format=1000w",
            "videoUrl": "https://youtu.be/J0DnG1_S92I",
            "description" : "A semi-strenuous alternative to your standard push-up, you can perform this tricep exercise from the comfort of your own home.  Here’s how: \n\n 1. Assume the push-up position, but with your hands together in a diamond-like formation (i.e. index fingers and thumbs touching). \n\n 2. Keeping your back straight, lower your chest until it almost touches the floor."
        },
        {
            "id": "27",
            "bodyRegion": "Triceps",
            "exercisesName": "Bench Dip",
            "imageUrl": "https://www.burnthefatinnercircle.com/members/images/1093d.png",
            "videoUrl": "https://youtu.be/jdFzYGmvDyg",
            "description" : "Unlike the tricep dip, this basic workout doesn’t require copious amounts of muscle or experience. Grab a standard workout bench and perform the following steps:\n\n 1. Stand up and face away from the bench, grabbing it with both hands at shoulder-width. \n\n 2. Keeping your legs straight and extended in front of you, slowly lower your body until your arms and forearms are at 90-degree angles. \n\n 3. Push through at the triceps as you lift back to the starting position."
        },
        {
            "id": "28",
            "bodyRegion": "Triceps",
            "exercisesName": "One-Arm Overhead Extension",
            "imageUrl": "https://images.squarespace-cdn.com/content/v1/55e406fbe4b0b03c5e7543ae/1493844683178-DZ1MAYUKOM1HJLTMYKFN/One+Arm+Overhead+Standing+Triceps+Extensions",
            "videoUrl": "https://youtu.be/jTQWYdWLvys",
            "description" : "Odds are you’re already doing something like this, making it a fairly simple and approachable tricep exercise. Here’s how to execute: \n\n 1. Sit perfectly upright on a workout bench and grab a dumbbell with one hand. \n\n 2. Holding the dumbbell, lift your arm slightly behind your head with your elbow bent. \n\n 3. Extend your elbow until your arm is straight overhead.\n\n 4. Perform 10 reps with one arm before switching to the other to round out the set."
        },
        {
            "id": "29",
            "bodyRegion": "Triceps",
            "exercisesName": "Standard Push-Up",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2019/04/push-up-750x474.jpg",
            "videoUrl": "https://youtu.be/IODxDxX7oi4",
            "description" : "An oldie but goodie, the classic push-up builds strength in your core, chest, and triceps. To crank up that intensity dial, consider bringing in a weight vest. Pardon us while we tell you how to perform an exercise you know all too well: \n\n 1. Keeping your hands beneath your shoulders, your core locked, and your body in a straight line, prop yourself above the floor on your hands and toes. \n\n 2. Lower your body until your chest is just above the ground. \n\n 3. Thrust upward."
        },
        {
            "id": "30",
            "bodyRegion": "Triceps",
            "exercisesName": "Straight Arm Cable Pull-Down",
            "imageUrl": "https://i.pinimg.com/564x/8d/11/98/8d1198dde006d17870791132ed14af61.jpg",
            "videoUrl": "https://youtu.be/AjCCGN2tU3Q",
            "description" : "In case the title’s not a dead giveaway, you’ll need a cable machine for this tricep exercise, which forms a superset. Let’s get into it: \n\n 1. Attach a rope to the high pulley of the cable station. \n\n 2. Grab the handle and face away from the machine, keeping your hands even with your shoulders.\n\n 3. Fully extend your arm forward in front of your head. \n\n 4. Return to the starting position.\n\n 5. Repeat for 10-12 reps. \n\n 6. Move directly into a straight arm cable pull-down, which involves grabbing the handle from the top pulley, palms facing one another. \n\n 7. Bend 30 degrees forward at the waist, keeping your arms fully extended. \n\n 8. Pull the bar down until your hands are even with your thighs."
        },
        {
            "id": "31",
            "bodyRegion": "Triceps",
            "exercisesName": "Straight Arm Cable Pull-Down",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2019/04/incline-dumbbell-bench-press.jpg",
            "videoUrl": "https://youtu.be/0G2_XV7slIg",
            "description" : "Here’s another tricep exercise you might already be performing. This is how to get it done: \n\n 1. Position your workout bench at a 45-degree angle.\n\n 2. Lie back on the bench and lift the dumbells to shoulder height, palms facing outward.\n\n 3. Exhale as you simultaneously press up with both arms.\n\n 4. Lock out your arms and contract your chest before slowly returning to the start position."
        }
        
        
        
]
