    [
        {
            "id": "1",
            "bodyRegion": "Delts & Shoulders",
            "exercisesName": "Arnold Press (Anterior)",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://s35247.pcdn.co/wp-content/uploads/2018/09/3-2-800x600.png",
            "videoUrl": "https://www.youtube.com/watch?v=mXRhpXwW-gs",
            "description" : " 1. Grab your dumbbells. \n\n 2. Take a seat for efficiency, preferably on the workout bench. \n\n 3. Place the dumbbells on your thighs as you sit. \n\n 4. Initial position: Keep your back straight and lift the weights just above your shoulder in front of you ( palm facing towards you.) \n\n 5.Slowly raise your arms and twist your hands inwards and take your arms over your shoulder. Hold for a sec. \n\n 6. Bring back the arms slowly towards against the resistance, back to the initial position."

        },
        {
            "id": "2",
            "bodyRegion": "Delts & Shoulders",
            "exercisesName": "Dumbbell Side Raise (Lateral)",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://s35247.pcdn.co/wp-content/uploads/2018/09/2-2-800x600.png",
            "videoUrl": "https://www.youtube.com/watch?v=WJm9zA2NY8E",
            "description" : " 1. Pick your dumbbells. \n\n 2.Stand straight, chest out and feet not more than shoulder apart. \n\n 3.initial position: Lift the dumbbells on the side keeping arms slightly bent. Hold for a sec. \n\n 4.Slowly bring it back down."
        },
        {
            "id": "3",
            "bodyRegion": "Delts & Shoulders",
            "exercisesName": "Bent Over Lateral Raise (Posterior)",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://s35247.pcdn.co/wp-content/uploads/2018/09/1-2.png.webp",
            "videoUrl": "https://www.youtube.com/watch?v=ttvfGg9d76c",
            "description" : " 1. Grab your dumbbells. \n\n 2. Take a seat for efficiency, preferably on the workout bench. \n\n 3.Initial position: Bend forward almost 45 degrees and keep your hands on the side to let the dumbbells hanging. \n\n 4. Keeping your back straight and letting arms slightly bent, pull the dumbbells on the side, against the gravity. Hold for a sec. \n\n 5. Slowly bring back to initial position."
        },
        {
            "id": "4",
            "bodyRegion": "Lats",
            "exercisesName": "Lat Pull-down",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://fitbodybuzz.com/wp-content/uploads/2019/08/lat-pulldown-muscles-worked.png",
            "videoUrl": "hhttps://www.youtube.com/watch?v=2eyUzw9EMuU",
            "description" : " Wide-grip lat pulldown: The wider grip of this variation puts even more emphasis on your lats than a standard lat pulldown. \n\n 1. Grab the lat bar with an overhand grip and sit on the lat pulldown machine with your legs securely under the thigh pads and your feet on the floor. Your grip should be slightly wider than shoulder-width. \n\n 2. Rotate your shoulders outward to engage your lats. Your shoulder blades should be in a neutral or slightly protracted position. Keep your arms long with a slight bend in your elbows. Your shoulders should be directly over your hips with a neutral head and neck position. Your chin should remain tucked throughout the movement, as if you were holding an egg under your chin. All repetitions should begin from this starting position. \n\n 3. Initiate the downward movement by simultaneously pulling your shoulder blades down and pulling your elbows towards your body. Continue to pull your shoulder blades toward your spine as you squeeze your upper back and lat muscles until the lat bar reaches your collar bones. Pause at the bottom of the movement. \n\n 4.Begin the upward movement by simultaneously straightening your arms and allowing your shoulder blades to move up and away from your spine. Slowly allow the lat bar to travel back to the starting position. "
        },
        {
            "id": "5",
            "bodyRegion": "Lats",
            "exercisesName": "Straight-arm Lat Pulldown",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2020/01/straight-arm-pulldowns-muscles-worked.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=wcVDItawocI",
            "description" : " Wide-grip lat pulldown: The wider grip of this variation puts even more emphasis on your lats than a standard lat pulldown."
        },
        {
            "id": "6",
            "bodyRegion": "Lats",
            "exercisesName": "Straight-arm Lat Pulldown",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://www.inspireusafoundation.org/wp-content/uploads/2021/11/dumbbell-pullover-2048x1109.png",
            "videoUrl": "https://www.youtube.com/watch?v=5YStMv6m2g8",
            "description" : " 1. Lie across the bench with only your upper back and neck being supported by the bench \n\n 2. Hold dumbbell with both hands, forming a triangle with your hands or by gripping the inner plate \n\n 3. Hold the dumbbell directly above your chest with elbows bent slightly \n\n 4. Engage your core and slowly lower the dumbbell past your face and over your head as far as you can \n 5. Pull the dumbbell back over your face to starting position"
        },
        {
            "id": "7",
            "bodyRegion": "Lats",
            "exercisesName": "Inverted Row",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2018/05/inverted-row-guide.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=hXTc1mDnZCw",
            "description" : " 1. Set up bar slightly higher than your arm’s length above the ground \n\n 2. Sit under the bar with your legs stretched out in front of you \n 3. Reach up grabbing the bar with both hands using an overhand grip wider than shoulder width apart \n\n 4. Straighten your body so your arms are straight and heels are on the floor \n 5. Pull up by retracting your shoulder blades until your chest hits the bar \n\n 5. Slowly lower to starting position"
        },
        {
            "id": "8",
            "bodyRegion": "Lats",
            "exercisesName": "Underhand Yates Row",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://mybodyweightexercises.com/wp-content/uploads/2021/09/bent-over-rows-muscles-worked.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=vzMDGeH5lCY",
            "description" : " 1. Grab a barbell with both hands using an underhand grip at shoulder width \n\n 2. Bend and the knees and hinge forward at the hips at 45 degrees \n\n 3. Your arms should be almost fully extended with the bar over your thighs \n\n 4. Pull the bar up to your waist \n\n 5. Briefly pause at the top then slowly return to starting position"
        },
        {
            "id": "9",
            "bodyRegion": "Lats",
            "exercisesName": "High Cable Row/Face Pull ",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://fitnessvolt.com/wp-content/uploads/2019/08/face-pull-exercise-muscles-worked-details.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=eIq5CB9JfKE&t=314s",
            "description" : " Another common error is grip. Athletes should use an underhand grip as opposed to overhand. While performing the face pull it’s also important to make sure that you are taking a strong, stable athletic stance and leading with your hands and not your elbows. You never wants to lean backwards as this allows the lower back to contribute. If you find yourself doing this fault it’s likely because you’re making another common error… using too much weight. \n\n The weight you use on the face pull should be enough to get meaningful contractions in the target muscles for building strength but not so much weight that you need extra momentum or backward lean in order to move the weight. This is NOT a power move or an opportunity to demonstrate your strength."
        },
        {
            "id": "10",
            "bodyRegion": "Lats",
            "exercisesName": "Pull Ups",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://fitfact.dk/wp-content/uploads/2020/10/pullupsmuskler-1024x788.png",
            "videoUrl": "https://www.youtube.com/watch?v=eGo4IYlbE5g",
            "description" : " 1. Grab the bar, hands shoulder width apart using an overhand grip \n\n 2. Begin with arms completely straight and pull your chest up toward the bar as high as you can. \n\n 3. Hold briefly at the top then return to starting position"
        },
        {
            "id": "11",
            "bodyRegion": "Lats",
            "exercisesName": "Chin Ups",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://qph.fs.quoracdn.net/main-qimg-614a39f944254ddaba6e1252814e1b46-lq",
            "videoUrl": "https://www.youtube.com/watch?v=brhRXlOhsAM",
            "description" : " 1. Grab the bar, hands shoulder width apart palms with an underhand grip \n\n 2. Begin with arms completely straight and pull your chest up to the bar as high as you can \n\n 3. Hold briefly at the top then return to starting position"
        },
        {
            "id": "12",
            "bodyRegion": "Lats",
            "exercisesName": "Dombbell Rows",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://i.pinimg.com/originals/42/ba/3f/42ba3fde9e7f9b31f958d0c39db407fc.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=roCP6wCXPqo",
            "description" : " 1. Grab a dumbbell with a neutral grip with your right hand then place your right knee and right hand under your shoulder on a bench. Hold the dumbbell with your left arm straight directly under your left shoulder. \n\n 2. Pull the dumbbell upwards, bending at the elbow and keeping your arm close to your body until the dumbbell is next to your hip \n\n 3. Slowly lower to starting position"
        },
        {
            "id": "13",
            "bodyRegion": "Lats",
            "exercisesName": "Cable Supine Reverse Fly",
            "maxWeight" : "0",
            "maxRepetitions": "0",
            "imageUrl": "https://i.pinimg.com/originals/90/16/b8/9016b8476acd327cecdb20e84c27910c.jpg",
            "videoUrl": "https://www.youtube.com/watch?v=keVMaHL8ME0",
            "description" : " 1. Sit on a bench with your knees bent then reach forward and grab the triangle handle \n\n 2. Pull the handle back towards your navel keeping your back straight and squeezing your shoulder blades together \n\n 3. Slowly return to starting position"
        }
        
]
